/* Перетворіть user на JSON, після цього зробіть з нього знову об’єкт і запишіть його в іншу змінну.
 */
let user = {
    name: "Іван Іванов",
    age: 35,
};

let userJSON = JSON.stringify(user);
let userCopy = JSON.parse(userJSON);

/* У простих випадках циклічних посиланнь ми можемо виключити від серіалізації властивість, через яку воно виникло, за її ім’ям.
Але іноді ми не можемо просто використовувати назву, оскільки вона може використовуватися як і у циклічних посиланнях, так і в звичайних, потрібних нам, властивостях. Таким чином, ми можемо перевірити властивість за її значенням.
Напишіть функцію replacer, щоб серіалізувати все, але видалити властивості, які посилаються на meetup: */
