/* Напишіть скрипт, який просить відвідувача ввести два числа, і в результаті показує їх суму.
 */

let a = +prompt("Enter first number");
let b = +prompt("Enter second number");

alert(a + b);

//===================================================================================

/* Чому 6.35.toFixed(1) == 6.3?
Згідно з документацією Math.round і toFixed, округлюють до найближчого числа: 0..4 ведуть вниз, а5..9 ведуть вгору.
Як правильно округлити 6.35? */

Math.round(6.35 * 10) / 10;

//===================================================================================

/* Створіть функцію readNumber, яка запросить число, поки відвідувач не введе дійсне числове значення.

Отримане значення потрібно повернути як число.

Відвідувач також може зупинити процес, ввівши порожній рядок або натиснувши “CANCEL”. У цьому випадку функція повинна повернути null. */

function readNumber() {
    let a;

    do {
        a = prompt("Enter a number", "0");
    } while (!isFinite(a));

    if (a === null || a === "") return null;

    return a;
}

alert(readNumber());

//===================================================================================

/* Вбудована функція Math.random() створює випадкове значення від 0 до1 (не враховуючи 1).

Напишіть функцію random(min, max) для створення випадкового числа з плаваючою крапкою від min до max (не враховуючи max). */

function random(min, max) {
    return min + Math.random() * (max - min);
}

alert(random(1, 5));

//===================================================================================

/* Створіть функцію randomInteger(min, max), яка генерує випадкове ціле число від min до max включно.
Будь-яке число з інтервалу min..max повинно з’являтися з однаковою ймовірністю. */

function randomInteger(min, max) {
    return Math.round(min + Math.random() * (max - min));
}
alert(randomInteger());
